; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v1 ?v12)
             (pred_7 ?v2 ?v8)
             (pred_2 ?v1 ?v8)
             (pred_11 ?v6 ?v1 )
	     (pred_3 ?v1)
             (pred_12 ?v13)
             (pred_9 ?v2)
             (pred_4 ?v8)
             (pred_8 ?v1)
             (pred_5 ?v2)
             (pred_6 ?v1)
             (pred_1 ))



(:action op_4
:parameters (?v10 ?v5 ?v9 ?v4)
:precondition (and (pred_12 ?v10) (pred_12 ?v5) (pred_9 ?v9) (pred_4 ?v4)
          (pred_10 ?v10 ?v5) (pred_7 ?v9 ?v4)
                   (pred_2 ?v5 ?v4) (pred_3 ?v10) 
                   (pred_8 ?v5) (pred_5 ?v9))
:effect (and  (pred_6 ?v5) (not (pred_8 ?v5))))


(:action op_2
:parameters (?v10 ?v7)
:precondition (and (pred_12 ?v10) (pred_12 ?v7)
               (pred_3 ?v10) (pred_10 ?v10 ?v7) (pred_6 ?v7))
:effect (and (pred_3 ?v7) (not (pred_3 ?v10))))

(:action op_3
:parameters (?v10 ?v9)
:precondition (and (pred_12 ?v10) (pred_9 ?v9) 
                  (pred_3 ?v10) (pred_11 ?v9 ?v10) (pred_1 ))
:effect (and (pred_5 ?v9)
   (not (pred_11 ?v9 ?v10)) (not (pred_1 ))))


(:action op_5
:parameters (?v10 ?v3 ?v11)
:precondition (and (pred_12 ?v10) (pred_9 ?v3) (pred_9 ?v11)
                  (pred_3 ?v10) (pred_5 ?v11) (pred_11 ?v3 ?v10))
:effect (and (pred_5 ?v3) (pred_11 ?v11 ?v10)
        (not (pred_5 ?v11)) (not (pred_11 ?v3 ?v10))))

(:action op_1
:parameters (?v10 ?v9)
:precondition (and (pred_12 ?v10) (pred_9 ?v9) 
                  (pred_3 ?v10) (pred_5 ?v9))
:effect (and (pred_1 ) (pred_11 ?v9 ?v10) (not (pred_5 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_11 obj_10 obj_08 obj_18 obj_03 obj_16 obj_02 obj_14 obj_06 obj_19 obj_17 obj_20 obj_13 obj_05 obj_04
    obj_01 obj_15
    obj_07 obj_09
    )

    (:init
       (pred_1)

       (pred_12 obj_12)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_08)
       (pred_12 obj_18)
       (pred_12 obj_03)
       (pred_12 obj_16)
       (pred_12 obj_02)
       (pred_12 obj_14)
       (pred_12 obj_06)
       (pred_12 obj_19)
       (pred_12 obj_17)
       (pred_12 obj_20)
       (pred_12 obj_13)
       (pred_12 obj_05)
       (pred_12 obj_04)
       (pred_4 obj_01)
       (pred_4 obj_15)
       (pred_9 obj_07)
       (pred_9 obj_09)

       (pred_10 obj_12 obj_18)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_10 obj_16)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_18 obj_14)
       (pred_10 obj_18 obj_03)
       (pred_10 obj_18 obj_12)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_03 obj_16)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_03 obj_18)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_16 obj_02)
       (pred_10 obj_16 obj_10)
       (pred_10 obj_16 obj_03)
       (pred_10 obj_02 obj_17)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_16)
       (pred_10 obj_14 obj_20)
       (pred_10 obj_14 obj_06)
       (pred_10 obj_14 obj_18)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_03)
       (pred_10 obj_06 obj_14)
       (pred_10 obj_19 obj_05)
       (pred_10 obj_19 obj_17)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_17 obj_04)
       (pred_10 obj_17 obj_02)
       (pred_10 obj_17 obj_19)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_20 obj_14)
       (pred_10 obj_13 obj_05)
       (pred_10 obj_13 obj_06)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_05 obj_04)
       (pred_10 obj_05 obj_19)
       (pred_10 obj_05 obj_13)
       (pred_10 obj_04 obj_17)
       (pred_10 obj_04 obj_05)
       (pred_8 obj_11)
       (pred_8 obj_14)
       (pred_2  obj_11 obj_01)
       (pred_2  obj_14 obj_15)
       (pred_6 obj_12)
       (pred_6 obj_10)
       (pred_6 obj_08)
       (pred_6 obj_18)
       (pred_6 obj_03)
       (pred_6 obj_16)
       (pred_6 obj_02)
       (pred_6 obj_06)
       (pred_6 obj_19)
       (pred_6 obj_17)
       (pred_6 obj_20)
       (pred_6 obj_13)
       (pred_6 obj_05)
       (pred_6 obj_04)

       (pred_7  obj_07 obj_01)
       (pred_7  obj_09 obj_15)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_09 obj_08)
       (pred_3 obj_20)
    )

    (:goal (and
       (pred_11 obj_07 obj_16)
    ))
(:constraints
  (always (not (pred_3 obj_19)))
)
)

; plan
1. (op_2 obj_20 obj_13)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_13)
   goals met: 0 of 1
2. (op_2 obj_13 obj_06)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_06)
   goals met: 0 of 1
3. (op_2 obj_06 obj_03)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_03)
   goals met: 0 of 1
4. (op_2 obj_03 obj_16)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_16)
   goals met: 0 of 1
5. (op_2 obj_16 obj_02)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_02)
   goals met: 0 of 1
6. (op_2 obj_02 obj_17)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_17)
   goals met: 0 of 1
7. (op_3 obj_17 obj_07)
   deleted: (pred_11 obj_07 obj_17) (pred_1)
   added: (pred_5 obj_07)
   goals met: 0 of 1
8. (op_2 obj_17 obj_02)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_02)
   goals met: 0 of 1
9. (op_2 obj_02 obj_16)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_16)
   goals met: 0 of 1
10. (op_1 obj_16 obj_07)
   deleted: (pred_5 obj_07)
   added: (pred_1) (pred_11 obj_07 obj_16)
   goals met: 1 of 1
